package ru.progwards.java1.lessons.datetime;

/**
 * Реализовать класс для ручной профилировки производительности
 * программного кода. Профилировка программного кода - измерение
 * времени выполнения отдельных фрагментов кода с целью выявления
 * узких мест в производительности.
 */

public class Profiler {
    public static void enterSection(String name){
        // войти в профилировочную секцию, замерить время входа.

    }

    public static void exitSection(String name){
        // - выйти из профилировочной секции. Замерить время выхода,
        // вычислить промежуток времени между входом и выходом в миллисекундах.

    }
}
